public/stash/volunteering.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<link rel="stylesheet" href="https://san7o.github.io/micro-style.css/micro-style.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../index.html">Giovanni's Diary</a> &gt; <a href="../subjects.html">Subjects</a> &gt; <a href="stash.html">Stash</a> &gt;
</p>

<div id="outline-container-org788eb6b" class="outline-2">
<h2 id="org788eb6b">Volunteering</h2>
<div class="outline-text-2" id="text-org788eb6b">
<p>
I volunteered on various associations for several years. This was part
of my identity, I believed in the value of volunteering and in the
associations I was participating with. Coincidentally, Trento was
selected as the European Capital of Volunteering for 2024 so there was
a lot of movement in this area.
</p>

<p>
I joined <a href="https://www.caritas.org/">caritas</a> in my home town, I was preparing dishes for the poor.
In Trento I joined <a href="https://www.sat.tn.it/">SAT</a> where I was organizing Hikes with groups of
kids, sometimes I did trail maintenance. I then joined <a href="https://fondoambiente.it/">FAI</a> for some
time to promote history. I guess contributing on <a href="../programming/notes/contributing-to-openstreetmap.html">openstreetmap</a> is
considered volunteering.
</p>

<p>
Unfortunately I had to stop to focus on my career, but once I will
be more setup I am looking forward to do volunteering again.
</p>

<hr />

<p>
Travel: <a href="stash.html">Stash</a>, <a href="../theindex.html">Index</a> 
</p>
</div>
</div>
</div>
</body>
</html>
